app/views/employees/destroy.js.erb

DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 2]]
---
$('.delete_Employee').bind('ajax:success', function() {
   $(this).closest('tr').fadeOut();
});