app/controllers/employees_controller.rb

  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save
---
INSERT INTO "employees" ("name", "age", "address", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "pras"], ["age", 21], ["address", "bjkhjk"], ["country", "qwert"], ["created_at", "2016-08-03 22:00:26.282189"], ["updated_at", "2016-08-03 22:00:26.282189"]]

  def update
    respond_to do |format|
      if @employee.update(employee_params)
---
UPDATE "employees" SET "country" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["country", "qwerty"], ["updated_at", "2016-08-03 22:00:34.788675"], ["id", 1]]

  def destroy
	@employee = Employee.find(params[:id])
    @employee.destroy
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 2]]

    def set_employee
      @employee = Employee.find(params[:id])
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT 1  [["id", 1]]